balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256DA110.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU3" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PUE" edc:desc="" edc:mask="0x1" edc:name="CN32PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN33PUE" edc:desc="" edc:mask="0x1" edc:name="CN33PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN34PUE" edc:desc="" edc:mask="0x1" edc:name="CN34PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN35PUE" edc:desc="" edc:mask="0x1" edc:name="CN35PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN36PUE" edc:desc="" edc:mask="0x1" edc:name="CN36PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN37PUE" edc:desc="" edc:mask="0x1" edc:name="CN37PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN38PUE" edc:desc="" edc:mask="0x1" edc:name="CN38PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN39PUE" edc:desc="" edc:mask="0x1" edc:name="CN39PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN40PUE" edc:desc="" edc:mask="0x1" edc:name="CN40PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN41PUE" edc:desc="" edc:mask="0x1" edc:name="CN41PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN42PUE" edc:desc="" edc:mask="0x1" edc:name="CN42PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN43PUE" edc:desc="" edc:mask="0x1" edc:name="CN43PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN44PUE" edc:desc="" edc:mask="0x1" edc:name="CN44PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN45PUE" edc:desc="" edc:mask="0x1" edc:name="CN45PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN46PUE" edc:desc="" edc:mask="0x1" edc:name="CN46PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN47PUE" edc:desc="" edc:mask="0x1" edc:name="CN47PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN48PUE" edc:desc="" edc:mask="0x1" edc:name="CN48PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN49PUE" edc:desc="" edc:mask="0x1" edc:name="CN49PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PUE" edc:desc="" edc:mask="0x1" edc:name="CN50PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PUE" edc:desc="" edc:mask="0x1" edc:name="CN51PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PUE" edc:desc="" edc:mask="0x1" edc:name="CN52PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PUE" edc:desc="" edc:mask="0x1" edc:name="CN53PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PUE" edc:desc="" edc:mask="0x1" edc:name="CN54PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PUE" edc:desc="" edc:mask="0x1" edc:name="CN55PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PUE" edc:desc="" edc:mask="0x1" edc:name="CN56PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57PUE" edc:desc="" edc:mask="0x1" edc:name="CN57PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58PUE" edc:desc="" edc:mask="0x1" edc:name="CN58PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PUE" edc:desc="" edc:mask="0x1" edc:name="CN59PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PUE" edc:desc="" edc:mask="0x1" edc:name="CN60PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PUE" edc:desc="" edc:mask="0x1" edc:name="CN61PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PUE" edc:desc="" edc:mask="0x1" edc:name="CN62PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PUE" edc:desc="" edc:mask="0x1" edc:name="CN63PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-nnnnnnnn" edc:cname="CNPU5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000-00000000" edc:name="CNPU5" edc:nzwidth="0x10" edc:por="0000000-00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PUE" edc:desc="" edc:mask="0x1" edc:name="CN64PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PUE" edc:desc="" edc:mask="0x1" edc:name="CN65PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN66PUE" edc:desc="" edc:mask="0x1" edc:name="CN66PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN67PUE" edc:desc="" edc:mask="0x1" edc:name="CN67PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN68PUE" edc:desc="" edc:mask="0x1" edc:name="CN68PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PUE" edc:desc="" edc:mask="0x1" edc:name="CN69PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PUE" edc:desc="" edc:mask="0x1" edc:name="CN70PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PUE" edc:desc="" edc:mask="0x1" edc:name="CN71PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN73PUE" edc:desc="" edc:mask="0x1" edc:name="CN73PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN74PUE" edc:desc="" edc:mask="0x1" edc:name="CN74PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN75PUE" edc:desc="" edc:mask="0x1" edc:name="CN75PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN76PUE" edc:desc="" edc:mask="0x1" edc:name="CN76PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN77PUE" edc:desc="" edc:mask="0x1" edc:name="CN77PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN78PUE" edc:desc="" edc:mask="0x1" edc:name="CN78PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN79PUE" edc:desc="" edc:mask="0x1" edc:name="CN79PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
