balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256DA110.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR6" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR6" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0x3f" edc:name="RP12R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0x3f" edc:name="RP13R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP12R0" edc:desc="" edc:mask="0x1" edc:name="RP12R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R1" edc:desc="" edc:mask="0x1" edc:name="RP12R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R2" edc:desc="" edc:mask="0x1" edc:name="RP12R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R3" edc:desc="" edc:mask="0x1" edc:name="RP12R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R4" edc:desc="" edc:mask="0x1" edc:name="RP12R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R5" edc:desc="" edc:mask="0x1" edc:name="RP12R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP13R0" edc:desc="" edc:mask="0x1" edc:name="RP13R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R1" edc:desc="" edc:mask="0x1" edc:name="RP13R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R2" edc:desc="" edc:mask="0x1" edc:name="RP13R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R3" edc:desc="" edc:mask="0x1" edc:name="RP13R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R4" edc:desc="" edc:mask="0x1" edc:name="RP13R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R5" edc:desc="" edc:mask="0x1" edc:name="RP13R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR7" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR7" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP14R" edc:desc="" edc:mask="0x3f" edc:name="RP14R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP15R" edc:desc="" edc:mask="0x3f" edc:name="RP15R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP14R0" edc:desc="" edc:mask="0x1" edc:name="RP14R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R1" edc:desc="" edc:mask="0x1" edc:name="RP14R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R2" edc:desc="" edc:mask="0x1" edc:name="RP14R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R3" edc:desc="" edc:mask="0x1" edc:name="RP14R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R4" edc:desc="" edc:mask="0x1" edc:name="RP14R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R5" edc:desc="" edc:mask="0x1" edc:name="RP14R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP15R0" edc:desc="" edc:mask="0x1" edc:name="RP15R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R1" edc:desc="" edc:mask="0x1" edc:name="RP15R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R2" edc:desc="" edc:mask="0x1" edc:name="RP15R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R3" edc:desc="" edc:mask="0x1" edc:name="RP15R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R4" edc:desc="" edc:mask="0x1" edc:name="RP15R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R5" edc:desc="" edc:mask="0x1" edc:name="RP15R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR8" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR8" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP16R" edc:desc="" edc:mask="0x3f" edc:name="RP16R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP17R" edc:desc="" edc:mask="0x3f" edc:name="RP17R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP16R0" edc:desc="" edc:mask="0x1" edc:name="RP16R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R1" edc:desc="" edc:mask="0x1" edc:name="RP16R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R2" edc:desc="" edc:mask="0x1" edc:name="RP16R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R3" edc:desc="" edc:mask="0x1" edc:name="RP16R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R4" edc:desc="" edc:mask="0x1" edc:name="RP16R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R5" edc:desc="" edc:mask="0x1" edc:name="RP16R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP17R0" edc:desc="" edc:mask="0x1" edc:name="RP17R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R1" edc:desc="" edc:mask="0x1" edc:name="RP17R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R2" edc:desc="" edc:mask="0x1" edc:name="RP17R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R3" edc:desc="" edc:mask="0x1" edc:name="RP17R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R4" edc:desc="" edc:mask="0x1" edc:name="RP17R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R5" edc:desc="" edc:mask="0x1" edc:name="RP17R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
